nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/src/system/fmac_event.c
	dst = (struct nrf_wifi_rpu_debug_stats *)fmac_dev_ctx->debug_stats;
	if (dst) {
		nrf_wifi_mem_cpy(dst, &ev->stats, sizeof(ev->stats));
	}
	fmac_dev_ctx->debug_stats_req = false;
	status = NRF_WIFI_STATUS_SUCCESS;

out:
	return status;
}


static enum nrf_wifi_status umac_event_sys_umac_int_stats_process(
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
	void *event)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct umac_int_stats *ev = event;
	struct umac_int_stats *dst;

	if (!event) {
		LOG_ERR("%s: Invalid parameters", __func__);
		goto out;
	}

	if (!fmac_dev_ctx->umac_int_stats_req) {
		LOG_DBG("%s: UMAC int stats recd when req was not sent!",
				      __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
		goto out;
	}

	dst = (struct umac_int_stats *)fmac_dev_ctx->umac_int_stats;
	if (dst) {
		nrf_wifi_mem_cpy(dst, ev, sizeof(*ev));
	}
	fmac_dev_ctx->umac_int_stats_req = false;
	status = NRF_WIFI_STATUS_SUCCESS;

out:
	return status;
}
#endif /* NRF71_UTIL */

#if WIFI_NRF71_LOG_LEVEL >= NRF_WIFI_LOG_LEVEL_INF
struct error_stats_log_entry {
	unsigned int status_code;
	const char *msg;
};

static const struct error_stats_log_entry umac_error_stats_log[] = {
	{ UMAC_MEM_ALLOC_FAIL, "memory allocation failed" },
};

static const struct error_stats_log_entry lmac_error_stats_log[] = {
	{ RX_INT_MEM_UNDERRUN, "RX internal memory underrun" },
	{ DATA_PATH_STUCK, "data path stuck" },
	{ WIFI_REQ_TO_PTA_FAIL, "Wi-Fi request to PTA failed" },
	{ HW_DATA_PATH_DEACTIVATE_FAIL, "HW data path deactivation failed" },
	{ HW_DATA_PATH_ACTIVATE_FAIL, "HW data path activation failed" },
	{ CAPTURE_DMA_NOT_FINISHING, "capture DMA not finishing" },
	{ FEED_DMA_NOT_FINISHING, "feed DMA not finishing" },
	{ RF_PLL_RECOVERY_FAILED, "RF PLL recovery failed" },
	{ DEVICE_IS_ACTIVE_FOR_TOO_LONG, "device active for too long" },
};

static void log_error_stats(const char *func,
			    const char *type,
			    unsigned int status_code,
			    const struct error_stats_log_entry *table,
			    size_t table_size)
{
	size_t i;

	for (i = 0; i < table_size; i++) {
		if (table[i].status_code == status_code) {
			LOG_INF("%s: %s error: %s", func, type,
					       table[i].msg);
			return;
		}
	}

	LOG_INF("%s: %s error stats: status_code=%u", func, type,
			       status_code);
}
#endif /* WIFI_NRF71_LOG_LEVEL >= NRF_WIFI_LOG_LEVEL_INF */


static enum nrf_wifi_status umac_event_sys_proc_events(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
						       struct host_rpu_msg *rpu_msg)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	unsigned char *sys_head = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx;

	if (!fmac_dev_ctx || !rpu_msg) {
		return status;
	}


	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	sys_head = (unsigned char *)rpu_msg->msg;

	switch (((struct nrf_wifi_sys_head *)sys_head)->cmd_event) {
	case NRF_WIFI_EVENT_STATS:
		status = umac_event_sys_stats_process(fmac_dev_ctx,
						      sys_head);
		break;
	case NRF_WIFI_EVENT_INIT_DONE:
		fmac_dev_ctx->fw_init_done = 1;
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
	case NRF_WIFI_EVENT_DEINIT_DONE:
		fmac_dev_ctx->fw_deinit_done = 1;
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
#ifdef NRF71_RAW_DATA_TX
	case NRF_WIFI_EVENT_RAW_TX_DONE:
		status = nrf_wifi_fmac_rawtx_done_event_process(fmac_dev_ctx,
						(struct nrf_wifi_event_raw_tx_done *)sys_head);
		break;
#endif
#ifdef NRF71_SYSTEM_WITH_RAW_MODES
	case NRF_WIFI_EVENT_MODE_SET_DONE:
		status = nrf_wifi_fmac_if_mode_set_event_proc(fmac_dev_ctx,
						(struct nrf_wifi_event_raw_config_mode *)sys_head);
		break;
#endif
#if defined(NRF71_RAW_DATA_TX) || defined(NRF71_RAW_DATA_RX)
	case NRF_WIFI_EVENT_CHANNEL_SET_DONE: {
		struct nrf_wifi_event_set_channel *channel_event;
		struct nrf_wifi_sys_fmac_priv *sys_fpriv;
		struct nrf_wifi_fmac_vif_ctx *vif_ctx;
		unsigned int event_len = ((struct nrf_wifi_sys_head *)sys_head)->len;

		channel_event = (struct nrf_wifi_event_set_channel *)sys_head;
		vif_ctx = sys_dev_ctx->vif_ctx[channel_event->if_index];
		if (channel_event->status) {
			LOG_ERR("%s: set channel failed, status=%d",
					     __func__, channel_event->status);
		} else if (vif_ctx) {
			vif_ctx->channel = channel_event->chan.primary_num;
		}
		sys_fpriv = wifi_fmac_priv(fmac_dev_ctx->fpriv);
		if (sys_fpriv->callbk_fns.channel_set_done_callbk_fn) {
			sys_fpriv->callbk_fns.channel_set_done_callbk_fn(
				vif_ctx ? vif_ctx->os_vif_ctx : NULL,
				channel_event, event_len);
		}
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
	}
#endif /* NRF71_RAW_DATA_TX */
#if defined(NRF71_RAW_DATA_RX) || defined(NRF71_PROMISC_DATA_RX)
	case NRF_WIFI_EVENT_FILTER_SET_DONE:
		struct nrf_wifi_event_raw_config_filter *filter_event;

		filter_event = (struct nrf_wifi_event_raw_config_filter *)sys_head;
		if (!filter_event->status) {
			sys_dev_ctx->vif_ctx[filter_event->if_index]->packet_filter =
								filter_event->filter;
		}
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
#endif /* NRF71_RAW_DATA_RX || NRF71_PROMISC_DATA_RX */
	case NRF_WIFI_EVENT_DEBUG_STATS:
#ifdef NRF71_UTIL
		status = umac_event_sys_debug_stats_process(fmac_dev_ctx,
							    sys_head);
#else
		LOG_DBG("%s: Debug stats received", __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
#endif
		break;
	case NRF_WIFI_EVENT_INT_UMAC_STATS:
#ifdef NRF71_UTIL
		status = umac_event_sys_umac_int_stats_process(fmac_dev_ctx,
							       sys_head);
#else
		LOG_DBG("%s: UMAC int stats received", __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
#endif
		break;
	case NRF_WIFI_EVENT_ERROR_STATS: {
#if WIFI_NRF71_LOG_LEVEL >= NRF_WIFI_LOG_LEVEL_INF
		struct nrf_wifi_umac_event_error_stats *err_ev =
			(struct nrf_wifi_umac_event_error_stats *)sys_head;

		switch (err_ev->stats_type) {
		case RPU_STATS_TYPE_UMAC:
			log_error_stats(__func__, "UMAC", err_ev->status_code,
					umac_error_stats_log,
					sizeof(umac_error_stats_log) /
					sizeof(umac_error_stats_log[0]));
			break;
		case RPU_STATS_TYPE_LMAC:
			log_error_stats(__func__, "LMAC", err_ev->status_code,
					lmac_error_stats_log,
					sizeof(lmac_error_stats_log) /
					sizeof(lmac_error_stats_log[0]));
			break;
		default:
			LOG_INF("%s: Error stats event: "
					       "stats_type=%d status_code=%u",
					       __func__,
					       err_ev->stats_type,
					       err_ev->status_code);
			break;
		}
#endif /* WIFI_NRF71_LOG_LEVEL >= NRF_WIFI_LOG_LEVEL_INF */
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
	}
	case NRF_WIFI_EVENT_COEX_CONFIG: {
		struct nrf_wifi_event_coex_config *coex_event =
			(struct nrf_wifi_event_coex_config *)sys_head;
		struct nrf_wifi_sys_fmac_priv *sys_fpriv = wifi_fmac_priv(fmac_dev_ctx->fpriv);

